DESTINY_ARCANES = [1, 2, 5, 6, 9, 10, 13, 14, 15, 16, 20]

WILL_ARCANES = [3, 4, 7, 8, 11, 12, 17, 18, 19, 21, 22]


def get_arcane_type(number):
    if number in DESTINY_ARCANES:
        return "Аркан Долі"

    if number in WILL_ARCANES:
        return "Аркан Волі"

    return "Невідомий тип аркана"


def get_adult_meaning(arcane_type):
    if arcane_type == "Аркан Долі":
        return (
            "Якщо у вашій ЗК вийшов Аркан Долі, "
            "то сама Доля приведе вас до вашої зони комфорту. "
            "Від вас вимагається розслабитися та довіритися вищим силам."
        )

    if arcane_type == "Аркан Волі":
        return (
            "Якщо у вашій ЗК вийшов Аркан Волі, "
            "то для розкриття своїх потенціалів вам доведеться докласти зусиль, "
            "попрацювати та самостійно захищати свій комфорт."
        )

    return "Для цього аркана поки що немає опису."
