KCH_TEXTS = {
    1: "Самовпевненість, небажання навчатися та опановувати нове. Некоректне ставлення до вчителів і наставників. Заздрість до тих, хто знає більше.",

    2: "Заздрість, неповага до жінок, образливість, примхливість. Дратують чужі слабкості.",

    3: "Небажання мати дітей, жадібність, відчуття власності. Небажання слухати поради матері та враховувати думку дітей.",

    4: "Холодність, жорсткість, грубий підхід до людей. Зацикленість на кар'єрі та матеріальних благах. Бажання жити за чужий рахунок.",

    5: "Грубість і хамство. Неповага до чоловіків, мудрості старших і керівників. Егоїзм і зарозумілість.",

    6: "Непостійність, схильність до зрад і сумнівів. Небажання йти на компроміс. Жертвування своїми інтересами заради партнера.",

    7: "Лінь, небажання розвиватися та рухатися вперед. Спроба реалізовувати свої ідеї чужими руками. Підступність і хитрість.",

    8: "Ігнорування правил і законів. Мстивість, конфліктність. Нав'язування оточенню власних правил.",

    9: "Страх критичних ситуацій. Схильність до самотності. Позиція жертви. Страх болю та хвороб.",

    10: "Меркантильність, користь, фінансова нечесність. Схильність не повертати борги.",

    11: "Коліячість, забіякуватість, невміння контролювати емоції. Напад при відчутті небезпеки. Страх поразки.",

    12: "Хамство, нахабність, відсутність співчуття. Невдячність. Схильність до пригнічених станів і залежностей.",

    13: "Афективна поведінка, жорстокість. Невміння цінувати здоров'я. Схильність до егоїзму, хитрості та мстивості.",

    14: "Жадібність, споживацтво. Впевненість, що всі щось винні. Схильність до шантажу та використання людей.",

    15: "Шантаж, мстивість. Різкі перепади настрою. Схильність до зрад і фантазій.",

    16: "Самодурство, домострой, категоричність. Не йдуть на компроміс. У сім'ї можуть проявляти тиранію.",

    17: "Ідейність без дій. Схильність підштовхувати інших робити те, чого не роблять самі. Привласнення чужих заслуг.",

    18: "Брехливість, позерство, життя в ілюзіях. Перекручування фактів і перекладання відповідальності.",

    19: "Владність і бажання все контролювати. Схильність до маніпулювання людьми.",

    20: "Заперечення свого роду та традицій. Гидливість. Неповага до предків. Привласнення чужих родових заслуг.",

    21: "Схильність вважати себе найкрутішим. Любов до розкоші, брендів і прагнення потрапити у вищі кола будь-якою ціною.",

    22: "Схильність грати роль наївної людини. Хитрість і підступність. Перекладання провини та відповідальності на інших."
}
